const noti_txt = [
    [`26/07/02`, `${n("청이블")} 리더 효과 《고결한 동행》이 5종 속성 조건을 만족하지 못할 때에도 적용되던 오류 수정`],

    [`26/06/26`, `추천덱 n덱 결과 중 #1 뒤에 총 개수를 표시`],
    [`26/06/26`, `추천덱 auto로 n덱 계산 시 10억씩 더 차감 후 계산할 수 있는 버튼 추가`],
    [`26/06/08`, `조합검색 코드 최적화`],
    [`26/06/05`, `태그 페이지에서 bless 키워드 추가`],
    [`26/06/05`, `${n("무이카")}, ${n("수나미")}의 경우 구속이 낮아 쿨타임이 짧아질 경우 궁턴에 무조건 첫행동으로 궁극기를 사용하도록 자동계산에 반영`],
    [`26/06/04`, `인게임에서 ${n("오토히메")} 리더 효과 《관리자 권한》중 궁극기 추가 데미지 32.4%가 미적용되던 버그가 수정되었으므로 시뮬레이터에 적용`],
    [`26/06/04`, `시뮬레이터 ${n("오토히메")}, ${n("수브리")}, ${n("수나미")}, ${n("리고라")} 추가`],
    [`26/06/01`, `추천덱 계산 시 메모리 누수 현상 제거`],

    [`26/05/23`, `${n("란")}의 2패시브 정신통일 버프가 ${n("가뎀증")}이 아닌 ${n("공퍼증")}으로 적용되던 오류 수정`],
    [`26/05/16`, `행동불능인 캐릭터가 존재할 경우에도 행동순서 턴수를 올바르게 보여주도록 수정`],
    [`26/05/14`, `시뮬레이터 데미지 계산기 최적화 완료`],
    [`26/05/14`, `모든 타입의 데미지에 overflow시 붉은색으로 표기하도록 수정`],
    [`26/05/14`, `방어한 타깃에게 가하는 데미지의 계산을 「${n("받캐뎀")}+방어여부 판단」에서 「${n("방뎀증")}」으로 변경`],
    [`26/05/14`, `첫 행동 후 undo 실행 시 올바르게 동작하지 않던 버그 수정`],
    [`26/05/14`, `${n("포르네")}의 일반 공격으로 《수중 깊이》 중첩 상승에 의한 버프 활성화 조건을 만족할 때 적용 시점을 올바르게 수정`],
    [`26/05/14`, `${n("메살루")}의 《시저 님의 전속 메이드》 상태에서  궁극기 사용 시 자신이 추가데미지를 입힐 경우 ${n("가뎀증")} 30%가 미적용되던 오류 수정`],
    [`26/05/14`, `${n("농피")}의 《마력 수집》에 의한 ${n("공퍼증")} 100%가 즉시 적용되도록 수정`],
    [`26/05/14`, `${n("더피")}의 방어한 타깃에게 가하는 데미지 100%가 적용되지 않던 오류 수정`],
    [`26/05/14`, `${n("크브리")}의 궁극기 사용 시 아군의 《절묘한 비책》 중첩이 초기화되지 않던 오류 수정`],
    [`26/05/14`, `${n("관나나")}의 《이성치》 중첩에 따른 데미지 로직을 인게임과 일치하도록 수정`],
    [`26/05/11`, `${n("코사탄")} 리더 효과 《달콤한 살기》 중첩에 따른 버프가 자신에게만 적용되던 오류 수정`],
    [`26/05/06`, `Lab에서 결과창에 CD-1 횟수가 표시되도록 수정`],
    [`26/05/06`, `시뮬레이터 ${n("마더피")}, ${n("나리")} 추가`],

    [`26/04/30`, `데미지 계산 시, 곱연산 인수 중 하나라도 음수이면 0으로 적용되도록 수정`],
    [`26/04/19`, `추천덱 데이터 갱신 시점 표기`],
    [`26/04/08`, `시뮬레이터 ${n("신오라")}, ${n("강밀레")} 추가`],

    [`26/03/11`, `${n("얀코")} 리더 효과 중 《절대 매혹》버프가 자신에게 적용되지 않던 오류 수정`],
    [`26/03/11`, `평타 타수가 올바르게 적용되도록 수정`],
    [`26/03/11`, `${n("여야네")}의 피격 시 공퍼증이 ${n("아메")}의 패시브 「운명의 그물」보다 먼저 적용되던 오류 수정`],
    [`26/03/11`, `시뮬레이터 ${n("얀코")}, ${n("냉모모")} 추가`],

    [`26/02/12`, `태그 페이지에 배포 캐릭터(free_unit) 태그 추가`],
    [`26/02/12`, `모든 캐릭터의 정렬 순서를 출시순으로 변경`],
    [`26/02/05`, `《빛의 축복》,《바람의 축복》을 얻을 때 발동하는 버프가 같은 축복에 대해 공유하도록 수정`],
    [`26/02/04`, `${n("신야네")}, ${n("신이카")}의 궁극기 공격횟수가 1회였던 오류 수정`],
    [`26/02/04`, `${n("신야네")}의 봉인 매커니즘이 올바르게 적용되도록 수정`],
    [`26/02/04`, `${n("청이블")}의 「피격시 공격력 증가」버프가 1턴 낮게 적용되던 버그 수정`],
    [`26/02/04`, `${n("신릴리")}의 「피격시 아머 획득」 버프가 다음턴에 제거되던 버그 수정`],
    [`26/02/04`, `${n("벨레트")}의 《반격》버프가 1턴 빠르게 제거되던 버그 수정`],
    [`26/02/04`, `${n("놀라이티")}의 《극도의 흥분》버프가 늦게 제거되던 버그 수정`],
    [`26/02/04`, `시뮬레이터 ${n("신이카")}, ${n("신야네")}, ${n("신란")} 추가`],

    [`26/01/27`, `태그검색 페이지 추가`],
    [`26/01/09`, `인게임에서 ${n("신사기")} 3패시브가 버그수정 되었으므로 시뮬레이터에 적용`],
    [`26/01/07`, `시뮬레이터 진행 순서를 턴종료 → 피격 → 턴시작 에서 피격 → 턴종료 → 턴시작으로 변경`],
    [`26/01/07`, `시뮬레이터 ${n("신즈카")}, ${n("신사기")} 추가`],

    [`25/12/23`, `공격력/자신체력/타깃체력 비례 회복을 구분하도록 수정`],
    [`25/12/23`, `${n("카시피나")} 리더로 설정할 시 시뮬레이터 에러 수정`],
    [`25/12/17`, `보유 캐릭터에서 R/N 필터 제거, 상시 필터 추가`],
    [`25/12/16`, `Lab에서 ${n("허수++")} 체력 추가`],
    [`25/12/16`, `통계에서 캐릭터 이미지 클릭 시 이동한 페이지가 동작하지 않던 버그 수정`],
    [`25/12/15`, `보유 캐릭터에서 데미지 하한 설정을 직접 입력으로 변경`],
    [`25/12/15`, `${n("장바알")} 리더효과 「회복시 아군 전체에게 『공격 시 데미지』발동」버프가 팀원의 회복에 즉시 적용되던 버그 수정`],
    [`25/12/15`, `아군에게 공격시 회복 능력을 부여하는 캐릭터와 ${n("장바알")}을 함께 사용 시 첫 아군의 공격에 발동 데미지가 적용되던 버그 수정`],
    [`25/12/12`, `시뮬레이터 ${n("장바알")} 추가`],
    [`25/12/11`, `시뮬레이터 ${n("장이블")}, ${n("장사탄")}, ${n("마나나")} 추가`],
    [`25/12/07`, `${n("수살루")} 리더효과가 적용되지 않던 버그 수정`],
    [`25/12/01`, `조합 기록 갱신 우선순위를 ${n("13턴딜")} > ${n("허수턴")} 으로 변경`],

    [`25/11/16`, `${n("메살루")} 궁극기의 추가 데미지가 자신에게만 적용되던 버그 수정`],
    [`25/11/12`, `${n("메살루")} 리더효과 인게임 한글 번역 오류로 인한 스킬 수정`],
    [`25/11/12`, `특정 캐릭터가 undo를 사용할 경우 스택과 버프가 일치하지 않던 오류 수정`],
    [`25/11/12`, `${n("포르네")} 스택 버프의 적용방식이 실제와 다소 차이가 나던 오류 수정`],
    [`25/11/12`, `시뮬레이터 ${n("메살루")}, ${n("루티")} 추가`],

    [`25/10/16`, `${n("리리나")} 스택이 감소하지 않던 버그 수정`],
    [`25/10/15`, `Lab에서 캐릭별 피격 예약 기능 추가`],
    [`25/10/15`, `시뮬레이터 ${n("농피")}, ${n("리리나")} 추가`],

    [`25/09/11`, `${n("여야네")} 리더효과 《최우수 조연》이 자신에게도 적용되던 오류 수정`],
    [`25/09/10`, `시뮬레이터 ${n("여야네")}, ${n("리오")}, ${n("갸브리")} 추가`],

    [`25/08/22`, `추천덱 페이지에서 설정한 옵션을 확인하는 아이콘 추가`],
    [`25/08/21`, `추천덱 설정에 전체공격 옵션 추가`],
    [`25/08/13`, `시뮬레이터 ${n("백루루")}, ${n("유리")} 추가`],
    [`25/08/07`, `추천덱 데미지 조건 150억까지 추가 (auto 계산에도 적용)`],

    [`25/07/16`, `${n("적나나")}, ${n("해나나")} 해방 추가`],
    [`25/07/16`, `${n("꽃카나")} 《연꽃의 자태》 버프가 1턴 감소되었던 오류 수정`],
    [`25/07/16`, `시뮬레이터 ${n("승나미")}, ${n("기바알")} 추가`],
    [`25/07/04`, `추천덱 직군/속성조건 및 적 버프설정 추가`],

    [`25/06/25`, `시뮬레이터 ${n("성야네")} 추가`],
    [`25/06/13`, `조합목록, 조합검색, 추천덱에서 첫 로드 후 추가적인 로드가 기능하지 않을 경우 수동으로 로드할 수 있는 버튼 생성`],
    [`25/06/11`, `시뮬레이터 ${n("청이블")}, ${n("수릴리")}, ${n("수놀라")}, ${n("포르네")} 추가`],

    [`25/05/22`, `큰 화면의 경우 조합목록, 조합검색, 추천덱에서 다음 요소를 로드하지 못하는 오류 수정`],
    [`25/05/22`, `도트데미지가 방어에 영향을 받지 않도록 수정`],
    [`25/05/20`, `조합상세에서 Lab으로 바로가는 버튼 추가`],
    [`25/05/20`, `${n("유니스")} 평/궁에 회복옵션이 적용되지 않던 오류 수정`],
    [`25/05/20`, `Lab-option에서 레이드 보스 특수버프를 설정가능하도록 추가`],
    [`25/05/20`, `Lab에서 아군전체 쿨감, 적 방어가 가능하도록 추가`],
    [`25/05/09`, `${n("도엘리")} 리더 효과 《열정 나눔》이 "화속성 딜러 이외의 화속성 캐릭터"가 아닌 "화속성 딜러 이외의 아군 전체"에게 적용되던 오류 수정`],
    [`25/05/07`, `${n("스즈란")} 2패시브 아머 강화가 아군 전체에게 부여되던 오류 수정`],
    [`25/05/07`, `시뮬레이터 ${n("더피")}, ${n("새바키")} 추가`],

    [`25/04/10`, `제외캐릭터만 선택해도 조합검색이 가능하도록 수정`],
    [`25/04/09`, `시뮬레이터 ${n("도엘리")}, ${n("유니스")} 추가`],
    [`25/04/01`, `시뮬레이터 ${n("라벤더")} 추가`],

    [`25/03/19`, `추천덱 적 속성 설정 추가`],
    [`25/03/12`, `시뮬레이터 ${n("미아")}, ${n("애니")} 추가`],

    [`25/02/23`, `${n("농탄")}+반격캐릭이 편성된 조합 등록 불가`],
    [`25/02/20`, `${n("무이카")} 스택 감소 타이밍 수정`],
    [`25/02/13`, `${n("닌저")}의 《마왕 분신》스택이 초기화되지 않던 버그 수정`],
    [`25/02/13`, `${n("무이카")} 궁스택이 감소하지 않던 버그 수정`],
    [`25/02/12`, `${n("로오나")} 중첩과 데미지의 순서 조정`],
    [`25/02/12`, `${n("셀리나")} 3턴마다 ${n("공퍼증")}이 1중첩만 늘어나던 버그 수정`],
    [`25/02/12`, `시뮬레이터 ${n("무이카")}, ${n("닌저")}, ${n("꽃카나")} 추가`],
    [`25/02/11`, `추천덱 데이터 로드 서브 URL 추가`],
    [`25/02/07`, `추천덱 필수/제외캐릭터 설정 추가`],
    [`25/02/05`, `통계 데이터 상위 1k → 20%로 변경`],
    [`25/02/05`, `Lab 종료 팝업에 보스버프/조련/잠재 표시`],

    [`25/01/28`, `일본어 번역 추가`],
    [`25/01/25`, `추천덱 데미지 조건에 auto 추가`],
    [`25/01/25`, `시뮬레이터에서 캐릭별 딜미터에 반격, 도트데미지가 합산되도록 수정`],
    [`25/01/24`, `조합검색 트래픽 최적화`],
    [`25/01/23`, `${n("춘오라")}의 궁극기 버프 중 가뎀증이 구속에 상관없이 1구속 수치만큼 적용되던 버그 수정`],
    [`25/01/22`, `턴 종료시 1턴 남은 반격, 지속버프가 적용되지 않던 현상 수정`],
    [`25/01/22`, `시뮬레이터 ${n("춘오라")}, ${n("사샤")} 추가`],
    [`25/01/20`, `Lab 캐릭별 조련+잠재설정 추가`],
    [`25/01/16`, `시뮬레이터 캐릭별 딜미터 추가`],
    [`25/01/14`, `아이디, 비밀번호 찾기 기능 추가`],
    [`25/01/12`, `Lab 추가`],
    [`25/01/10`, `시뮬레이터 캐릭선택, 시뮬레이터 페이지에서 스킬정보 버튼 추가(언어, 캐릭터에 맞는 tkfmdata 캐릭터 페이지로 이동)`],
    [`25/01/10`, `시뮬레이터 캐릭선택 페이지에서 이미 등록된 조합인지 확인하는 버튼 추가`],
    [`25/01/08`, `시뮬레이터 해방 ${n("신이블")}, 해방 ${n("이치카")} 추가`],

    [`24/12/14`, `조합의 리더 이미지에 체력 증가량 표기`],
    [`24/12/14`, `추천덱 검색 시 체력 증가량 조건 추가`],
    [`24/12/11`, `시뮬레이터 ${n("크바알")}, ${n("크엘라")}, ${n("크브리")}, ${n("크치카")} 추가`],
    [`24/12/10`, `${n("신미나")} 리더 스킬오류 수정`],
    [`24/12/08`, `${n("할브리")} 리더 스킬오류 수정`],
    [`24/12/06`, `보유 캐릭터 정렬, 코드복사, 붙여넣기 추가`],

    [`24/11/29`, `${n("배이린")} 리더에 딜러가 없을 경우 에러 수정`],
    [`24/11/29`, `추천덱 데미지 자동계산 로직 수정`],
    [`24/11/19`, `조합상세 페이지에서 구속별 데미지 자동계산 기능 추가`],
    [`24/11/19`, `추천덱 검색시 응답대기가 뜨지 않도록 최적화`],
    [`24/11/15`, `${n("메나미")}의 궁극기 2옵션이 올바르게 적용되도록 수정(아군전체 → 수속성아군)`],
    [`24/11/15`, `${n("수루루")}의 궁극기 2옵션이 올바르게 적용되도록 수정(기본공격시 → 공격시)`],
    [`24/11/14`, `${n("이나스")}의 패시브 《시공간 지배》의 받캐뎀 중첩이 무한히 늘어나는 버그 수정`],
    [`24/11/13`, `시뮬레이터 ${n("메나미")}, ${n("메섹돌")} 추가`],
    [`24/11/13`, `모든 데미지에 대해 맥뎀 적용`],
    [`24/11/11`, `시뮬레이터 허수컷 이후에도 행동할 수 있도록 수정`],
    [`24/11/11`, `가한 총 데미지가 체력바 아래에 표시되도록 추가`],
    [`24/11/07`, `${n("농탄")}의 데미지가 인게임보다 적게 나오던 현상 수정 (기존의 계산식과 로직이 다름)`],
    [`24/11/07`, `시뮬레이터에서 공격력이 음수일 경우 0으로 적용`],
    [`24/11/05`, `조합 검색 시 제외 캐릭터 설정가능`],
    [`24/11/05`, `전지역 모집 SR 비율을 SR 등장확률로 수정`],
    [`24/11/01`, `SR${n("미나요미")}의 평타 추가데미지를 발동기로 수정`],
    [`24/11/01`, `더이상 5번${n("에밀리")}, ${n("아이카")}, ${n("유메")}를 힐러대용으로 등록하지 못하도록 수정`],

    [`24/10/30`, `시뮬레이터에서 매턴 전체피격 온오프 추가`],
    [`24/10/25`, `추천덱 1일 1회 제한 해제`],
    [`24/10/25`, `5구 데이터가 없고 1구 데이터가 있을 경우 1구속 행동순서를 보여주도록 수정`],
    [`24/10/24`, `트래픽 초과로 인한 서버 중단 해제, 서버 오류로 인한 모든 조합의 기록 삭제`],
    [`24/10/24`, `5구 13턴딜 50억미만인 덱은 주기적으로 삭제`],
    [`24/10/24`, `추천덱은 로그인 한 경우, 하루 한 번 이용가능`],
    [`24/10/24`, `발동기 관련 계산식 수정`],
    [`24/10/21`, `보유 캐릭터에서 자신의 구속 설정/저장/불러오기 가능`],
    [`24/10/21`, `추천덱 검색 시 허수턴/13턴(5)/13턴(1) 삭제, 자동으로 구속맞춤으로 검색됨`],
    [`24/10/21`, `저장된 행동순서를 이행할 수 없는 경우(구속에 따른 쿨변화) 계산하지 않음`],
    [`24/10/18`, `궁극기 효과에 『궁극기 발동 시 ~ 』 버프가 있는 경우의 로직 오류 수정`],
    [`24/10/16`, `${n("수잔")}, ${n("농탄")} 추가`],
    [`24/10/16`, `${n("아메")}의 첫 번째 궁극기 효과가 자신에게도 적용되던 버그 수정`],
    [`24/10/03`, `SR ${n("리츠키")} 시뮬레이터 추가`],
    [`24/10/03`, `${n("불타라")} 쿨감면역이 광속딜러가 아닌 광속아군 전체에 적용되던 버그 수정`],
    [`24/10/03`, `패시브/리더효과 첫턴 쿨감의 경우 패시브 적용 시점이 아닌 턴이 시작할때 적용되도록 수정`],
    [`24/10/02`, `해방 ${n("노엘리")}, 해방 ${n("페바알")} 추가`],
    [`24/10/02`, `${n("신바알")} 패시브 《시크릿 연애 대작전》의 『2턴마다 《밀당의 매력》 1중첩 증가』 버프가 한 턴 늦게 발동하는 버그 수정`],

    [`24/09/30`, `조합검색 페이지에서도 턴수가 같은 경우 13턴딜기준으로 정렬하도록 수정`],
    [`24/09/30`, `올 1구속 13턴딜 기준 정렬하는 기능 추가`],
    [`24/09/30`, `추천덱 생성 시에도 턴수 합이 같은 경우 13턴딜 합 기준으로 정렬하도록 수정`],
    [`24/09/30`, `${n("아메")}, ${n("바야네")}, ${n("바이블")} 추가`],
    [`24/09/30`, `${n("악미루")}의 궁극기 효과 "공격 시 발동데미지" 옵션이 자신의 궁에도 적용되던 오류 수정`],
    [`24/09/30`, `${n("바야네")}의 리더 효과 《타짜 입장》의 ${n("받속뎀")}(최대 50중첩)이 자신의 중첩만 늘리던 오류 수정`],
    [`24/09/30`, `추천덱 검색 시 조건을 설정가능하도록 수정`],
    [`24/09/30`, `SR ${n("타노시아")}, ${n("호타루")} 추가`],
    [`24/09/30`, `궁극기 타격 횟수가 여러 번일 경우 각 타격마다 오버플로를 계산하도록 수정 (ex ${n("놀라이티")} 맥뎀X)`],
    [`24/09/30`, `${n("앨루루")} 1, 2구속 궁극기 효과가 4 → 3턴 지속으로 수정`],
    [`24/09/30`, `시뮬레이터 캐릭터 선택 시, 선택된 캐릭터를 드래그해서 순서를 바꿀수 있도록 적용`],
    [`24/09/30`, `통계 페이지 추가`],
    [`24/09/30`, `중국어 간체, 번체 번역 추가`],
    [`24/09/30`, `통계 페이지에 사이트 통계 추가`],

    [`24/08/30`, `지속적인 회복수단이 없는 덱을 더이상 등록할 수 없도록 수정`],
    [`24/08/30`, `조합검색 결과가 스크롤을 내릴 때마다 20개씩 로드되도록 수정 (기존에는 한번에 전부 로드)`],
    [`24/08/30`, `${n("뷰저")}/${n("수저")}의 체력비례뎀이 공격데미지가 아닌 추가데미지쪽에 합산되도록 수정(맥뎀이슈)`],
    [`24/08/30`, `${n("수섹돌")} 궁극기의 ${n("받뎀증")}이 데미지를 가하기 이전에 적용되도록 수정`],
    [`24/08/30`, `${n("익루루")} 궁극기 효과로 인한 《파티 사회자》, 《파티 참가자》 중첩 증가가 버프 부여가 끝나고 적용되도록 수정`],
    [`24/08/30`, `시뮬레이터에서 각각의 캐릭터에 구속력 설정이 가능하도록 수정`],
    [`24/08/30`, `캐릭터를 선택하는 페이지에서 기본적으로 SSR이 선택되어 있도록 수정`],
    [`24/08/30`, `시뮬레이터 종료 시 결과창에 엔트리/구속 표기 추가`],
    [`24/08/30`, `시뮬레이터 진행 중 캐릭터 이미지 우측 상단에 구속 표시`],
    [`24/08/30`, `${n("마브리")} 리더 《정의의 이름으로 널 심판하겠다☆》 버프가 1턴 동안 유지되도록 수정`],
    [`24/08/30`, `조합을 클릭 시 새 창을 열도록 변경`],
    [`24/08/30`, `${n("곤즈카")}, ${n("츠바키")} 캐릭터 추가`],
    [`24/08/30`, `${n("냥루루")} 리더 《수인화》의 받일뎀 15%증가가 궁극기에도 적용되도록 수정(인게임 툴팁 오류)`],
    [`24/08/30`, `행동시 힐을 하는 경우 행동시 버프의 가장 마지막에 적용되도록 수정`],
    [`24/08/30`, `13턴 전에 허수컷을 해도 13턴까지 행동 가능하도록 수정(정확한 13턴딜 계산을 위함)`],
    [`24/08/30`, `추가버프 효과(ex ${n("수살루")}궁극기)로 회복이 여러번 될 경우 1번으로 적용되도록 수정`],
    [`24/08/30`, `시뮬레이터 종료 후 팝업이 뜨고 난 이후에 턴이 1만큼 더 올라가는 현상 제거`],
    [`24/08/30`, `추천덱 생성 시 작업 진행도를 %로 표시하도록 수정`],
    [`24/08/30`, `조합설명 삭제, 조합수정 삭제`],
    [`24/08/30`, `시뮬레이터 종료 시 딜량/${n("허수")} 갱신될 경우 조합수정된 것으로 간주`],
    [`24/08/30`, `보유 캐릭터 저장/불러오기 시 팝업으로 한번 더 확인하도록 수정`],
    [`24/08/30`, `${n("카나")}의 궁극기 효과의 ${n("받뎀감")}, ${n("공퍼증")}이 아군 전체에게 적용되도록 수정`],
    [`24/08/30`, `조합목록 페이지에서 턴수 기준 정렬 시 턴수가 같으면 13턴딜로 정렬하도록 수정`],
    [`24/08/30`, `${n("키베루")} 《자주 학습》, 《소극 적응》효과가 첫 턴 이후에도 적용되던 버그 수정`],
    [`24/08/30`, `영어 번역 추가`],

    [`24/07/30`, `"행동시 ~중첩버프 추가" 인 경우만 버프적용이 되지 않던 오류 수정`],
    [`24/07/30`, `시뮬레이터의 버프 아이콘 클릭 시 팝업을 띄우도록 수정`],
    [`24/07/30`, `${n("악미루")}의 궁극기 발동데미지 추가 버프가 자신에게는 적용되지 않던 오류 수정`],
    [`24/07/30`, `${n("악미루")} 리더의 ${n("받속뎀")} 코드오류 수정`],
    [`24/07/30`, `${n("뇨로")} 궁극기 ${n("가뎀증")} → ${n("받캐뎀")}으로 수정`],
    [`24/07/30`, `${n("신바알")} ${n("공퍼증")} 1중첩 추가가 2턴마다(2n+1턴)이 아닌 2n턴에 적용되던 오류 수정`],
    [`24/07/30`, `${n("수섹돌")} 3턴/4턴마다 발동데미지 추가 버프가 궁극기에 적용되지 않던 오류 수정`],
    [`24/07/30`, `${n("천사기")} 리더효과 《시기의 화염》 적용 오류 수정`],
    [`24/07/30`, `최대데미지 한계를 적용 (2^31-1) + 오버플로 시 빨간색 데미지 표기`],
];

function n(txt) {
    return `<span translate="no"> ${t(txt)} </span>`
}

document.addEventListener("DOMContentLoaded", function() {
    const groupedData = {};

    // 1. 순서 그대로 월별 데이터 그룹화 (이미 내림차순이므로 순서 유지)
    noti_txt.forEach(item => {
        const fullDate = item[0];
        const text = item[1];
        const ym = fullDate.substring(0, 5); 

        if (!groupedData[ym]) {
            groupedData[ym] = [];
        }
        groupedData[ym].push([fullDate, text]);
    });

    // 2. 정렬 과정 없이 객체의 Key를 순서대로 가져옴
    const months = Object.keys(groupedData);

    // 3. HTML 템플릿 생성
    const htmlList = months.map((ym, i) => {
        const list = groupedData[ym];
        const isOpen = (i === 0); // 첫 번째 월만 열어둠
        return makeTxtBox(ym, list, isOpen);
    });

    // 3.5. 배열 맨 앞에 공지 타이틀 삽입
    htmlList.unshift(`
        <div class="block">
            <div class="margin-left titleblock"><span id="titleboxText" class="titlebox">${t("공지")}</span></div>
        </div>
    `);

    // 4. main-container에 주입
    const container = document.getElementById("main-container");
    if (container) {
        container.innerHTML = htmlList.join("");
    }
});

// HTML 블록 생성 함수
function makeTxtBox(ym = "24/07", list, isOpen = false) {
    const title = ym.replace(/^(\d{2})\/(\d{2})$/, "20$1 / $2");
    const idNum = ym.replace("/", "");
    const res = [];
    
    for(let i = 0; i < list.length; i++) {
        res.push(list[i][0] + " " + list[i][1] + (i != (list.length-1) ? "<hr>" : ""));
    }

    const displayClass = isOpen ? "" : "d-n";

    return `<div class="block c-p" onclick="show('${idNum}')">
        <div class="y-m">${title}</div>
        <div id="ym-${idNum}" class="${displayClass}">${res.join("")}</div>
    </div>`;
}

// 토글 함수
function show(n) {
    const div = document.getElementById(`ym-${n}`);
    const bool = div.classList.contains("d-n");
    if (bool) div.classList.remove("d-n");
    else div.classList.add("d-n");
}